tap "fujiwara/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "knqyf263/utern"

brew "asdf"
brew "awscli"
brew "bat"
brew "buf"
brew "colordiff"
brew "ctop"
brew "curl"
brew "direnv"
brew "docker-compose"
brew "duf"
brew "expect" # unbuffer に必要 ref: https://dev.classmethod.jp/articles/fzf-original-app-for-git-add/
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fujiwara/tap/aswrap"
brew "fujiwara/tap/ecrm"
brew "fujiwara/tap/ecsta"
brew "fujiwara/tap/lambroll"
brew "fzf"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "git-delta"
brew "git-secrets"
brew "gnumeric" # ssconvert に必要
brew "grep"
brew "grpcurl"
brew "htop"
brew "imagemagick"
brew "jq"
brew "knqyf263/utern/utern"
brew "lazydocker"
brew "libyaml" # ruby build に必要 ref: https://qiita.com/notakaos/items/e3e30443b1e57f84e7d8
brew "mas"
brew "nkf"
brew "protobuf"
brew "ripgrep"
brew "sheldon"
brew "sops"
brew "starship"
brew "terminal-notifier"
brew "tflint"
brew "tfschema"
brew "tig"
brew "tmux"
brew "trash"
brew "tree"
brew "wget"
brew "yt-dlp"
brew "zsh"

cask "1password"
cask "appcleaner"
cask "barrier"
cask "brave-browser"
cask "charles"
cask "cyberduck"
cask "deepl"
cask "discord"
cask "discord@ptb"
cask "docker"
cask "dropbox"
cask "flux"
cask "font-ricty-diminished"
cask "fuwari"
cask "google-chrome"
cask "google-chrome@beta"
cask "google-chrome@canary"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keepassx"
cask "keyclu"
cask "microsoft-edge"
cask "mitmproxy"
cask "mysqlworkbench"
cask "obsidian"
cask "parallels"
cask "raycast"
cask "session-manager-plugin"
cask "slack"
cask "snes9x"
cask "the-unarchiver"
cask "tradingview"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

mas "Amphetamine", id: 937984704
mas "Display Maid", id: 450063525
mas "Divvy", id: 413857545
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Numbers", id: 409203825
mas "Okta Verify", id: 490179405
mas "Pages", id: 409201541
mas "Paste Plain Text", id: 1407015686
mas "Perplexity", id: 6714467650
mas "ScreenNote", id: 1258500140
mas "Speedtest", id: 1153157709
mas "VirusBarrier Scanner", id: 1200445649
mas "Xcode", id: 497799835
mas "grsyncx", id: 1506997025

vscode "JeylaniB.pinescript"
vscode "MS-CEINTL.vscode-language-pack-ja"
